{
   "name": "model_1",
   "layers": [
      {
         "name": "input_1",
         "class_name": "InputLayer",
         "config": {
            "batch_input_shape": [
               null,
               12
            ],
            "dtype": "int16",
            "sparse": false,
            "name": "input_1"
         },
         "inbound_nodes": []
      },
      {
         "name": "embedding_1",
         "class_name": "Embedding",
         "config": {
            "name": "embedding_1",
            "trainable": false,
            "batch_input_shape": [
               null,
               [
                  12
               ]
            ],
            "dtype": "float32",
            "input_dim": 50,
            "output_dim": 8,
            "embeddings_initializer": {
               "class_name": "RandomUniform",
               "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
               }
            },
            "embeddings_regularizer": null,
            "activity_regularizer": null,
            "embeddings_constraint": null,
            "mask_zero": false,
            "input_length": [
               12
            ]
         },
         "inbound_nodes": [
            [
               [
                  "input_1",
                  0,
                  0,
                  {}
               ]
            ]
         ]
      },
      {
         "name": "lstm_1",
         "class_name": "LSTM",
         "config": {
            "name": "lstm_1",
            "trainable": true,
            "dtype": "float32",
            "return_sequences": true,
            "return_state": false,
            "go_backwards": false,
            "stateful": false,
            "unroll": false,
            "units": 128,
            "activation": "tanh",
            "recurrent_activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
               }
            },
            "recurrent_initializer": {
               "class_name": "Orthogonal",
               "config": {
                  "gain": 1.0,
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "unit_forget_bias": true,
            "kernel_regularizer": null,
            "recurrent_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "recurrent_constraint": null,
            "bias_constraint": null,
            "dropout": 0.3,
            "recurrent_dropout": 0.0,
            "implementation": 2
         },
         "inbound_nodes": [
            [
               [
                  "embedding_1",
                  0,
                  0,
                  {}
               ]
            ]
         ]
      },
      {
         "name": "lstm_2",
         "class_name": "LSTM",
         "config": {
            "name": "lstm_2",
            "trainable": true,
            "dtype": "float32",
            "return_sequences": true,
            "return_state": false,
            "go_backwards": false,
            "stateful": false,
            "unroll": false,
            "units": 64,
            "activation": "tanh",
            "recurrent_activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
               }
            },
            "recurrent_initializer": {
               "class_name": "Orthogonal",
               "config": {
                  "gain": 1.0,
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "unit_forget_bias": true,
            "kernel_regularizer": null,
            "recurrent_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "recurrent_constraint": null,
            "bias_constraint": null,
            "dropout": 0.3,
            "recurrent_dropout": 0.0,
            "implementation": 2
         },
         "inbound_nodes": [
            [
               [
                  "lstm_1",
                  0,
                  0,
                  {}
               ]
            ]
         ]
      },
      {
         "name": "lstm_3",
         "class_name": "LSTM",
         "config": {
            "name": "lstm_3",
            "trainable": true,
            "dtype": "float32",
            "return_sequences": false,
            "return_state": false,
            "go_backwards": false,
            "stateful": false,
            "unroll": false,
            "units": 16,
            "activation": "tanh",
            "recurrent_activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
               }
            },
            "recurrent_initializer": {
               "class_name": "Orthogonal",
               "config": {
                  "gain": 1.0,
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "unit_forget_bias": true,
            "kernel_regularizer": null,
            "recurrent_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "recurrent_constraint": null,
            "bias_constraint": null,
            "dropout": 0.3,
            "recurrent_dropout": 0.0,
            "implementation": 2
         },
         "inbound_nodes": [
            [
               [
                  "lstm_2",
                  0,
                  0,
                  {}
               ]
            ]
         ]
      },
      {
         "name": "dense_1",
         "class_name": "Dense",
         "config": {
            "name": "dense_1",
            "trainable": true,
            "dtype": "float32",
            "units": 50,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         },
         "inbound_nodes": [
            [
               [
                  "lstm_3",
                  0,
                  0,
                  {}
               ]
            ]
         ]
      }
   ],
   "input_layers": [
      [
         "input_1",
         0,
         0
      ]
   ],
   "output_layers": [
      [
         "dense_1",
         0,
         0
      ]
   ]
}